# Cable Type Duplicate Method

Source: https://www.revitapidocs.com/2026/95d103bf-aee0-0aca-5831-f4e15cc7c365.htm

---

| Cable Type Duplicate Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Duplicate | Duplicates this Cable Type. |
|  | Duplicate(String) | Duplicates an existing element type and assigns it a new name. |

Top See Also

#### Reference

CableType Class Autodesk.Revit.DB.Electrical Namespace